       IDENTIFICATION DIVISION.
       PROGRAM-ID. P108.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 S1 PIC X(8) VALUE "ABCDEFGH".
       01 S2 PIC X(8) VALUE "ABCDEFGH".
       01 S3 PIC X(8) VALUE "ABCDEFGH".
       PROCEDURE DIVISION.
           INSPECT S1 REPLACING CHARACTERS BY "*".
           DISPLAY "1 [" S1 "]".
           INSPECT S2 REPLACING CHARACTERS BY "*" BEFORE "E".
           DISPLAY "2 [" S2 "]".
           INSPECT S3 REPLACING CHARACTERS BY "*" AFTER "C".
           DISPLAY "3 [" S3 "]".
           STOP RUN.
