       IDENTIFICATION DIVISION.
       PROGRAM-ID. P140.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REC.
          05 ANUM PIC 99 VALUE 7.
          05 SECRET PIC 99 VALUE 42.
       01 OUT PIC X(120).
       PROCEDURE DIVISION.
           XML GENERATE OUT FROM REC NAME ANUM IS "id" SUPPRESS SECRET.
           DISPLAY "X=[" FUNCTION TRIM(OUT) "]".
           STOP RUN.
