       IDENTIFICATION DIVISION.
       PROGRAM-ID. P24.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. CURRENCY SIGN IS "F".
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 N PIC 9(4)V99 VALUE 1234.56.
       01 E PIC FF,FF9.99.
       01 G PIC F9999.99.
       PROCEDURE DIVISION.
           MOVE N TO E.
           DISPLAY "EDIT " E.
           MOVE N TO G.
           DISPLAY "FIX " G.
           STOP RUN.
