      *> @std: ibm
       IDENTIFICATION DIVISION.
       PROGRAM-ID. P26.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC X(3).
       01 N PIC 9(3).
       PROCEDURE DIVISION.
           DISPLAY "[" A "][" N "]".
           STOP RUN.
