       IDENTIFICATION DIVISION.
       PROGRAM-ID. P31.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           SWITCH-1 ON STATUS IS SW1-ON OFF STATUS IS SW1-OFF.
       PROCEDURE DIVISION.
           IF SW1-ON DISPLAY "S1=ON" ELSE DISPLAY "S1=OFF" END-IF.
           IF SW1-OFF DISPLAY "S1OFF=YES" ELSE DISPLAY "S1OFF=NO" END-IF.
           STOP RUN.
