000010* @format: fixed
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. P34.
000300* this is a comment line in col 7
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 N PIC 9(3) VALUE 42.
000700 PROCEDURE DIVISION.
000800     DISPLAY "FIX " N.
000900     DISPLAY "TWO".
001000     STOP RUN.
