
       >>LISTING OFF
       01 TEST1-VAR PIC X(2) VALUE "OK".
       01 TEST2-VAR PIC X(2) VALUE "OK".
       01 TEST3-VAR PIC X(2) VALUE "OK".
       01 TEST4-VAR PIC X(2) VALUE "OK".
       >>LISTING ON
       01 TEST5-VAR PIC X(2) VALUE "OK".
       01 TEST6-VAR PIC X(2) VALUE "OK".
       01 TEST7-VAR PIC X(2) VALUE "OK".
       01 TEST8-VAR PIC X(2) VALUE "OK".
