       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG5.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ACCOUNT.
       COPY TPL REPLACING ==:PFX:== BY ==ACCT== ==AMOUNT== BY ==BAL==.
       PROCEDURE DIVISION.
           STOP RUN.
