       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG6.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BIG.
       COPY NEST REPLACING ==:PFX:== BY ==OUTER== ==AMOUNT== BY ==QQ==.
       PROCEDURE DIVISION.
           STOP RUN.
