       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CUSTOMER.
       COPY TPL REPLACING ==:PFX:== BY ==CUST==.
       PROCEDURE DIVISION.
           STOP RUN.
