       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CUSTOMER.
       COPY CUSTREC.
       PROCEDURE DIVISION.
           STOP RUN.
