       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BIGREC.
       COPY FULLCUST.
       01 OTHERREC.
       COPY ADDR.
       PROCEDURE DIVISION.
           STOP RUN.
