       05 :PFX:-ID    PIC 9(6).
       05 :PFX:-NAME  PIC X(20).
       05 AMOUNT      PIC S9(7)V99 COMP-3.
       05 KEEP-AMOUNT PIC 9(4).
       05 BB-:PFX:    PIC X(2).
