
       01  TEXTFILE-2-NAME          PIC X(080)     VALUE "TEXTFILE.2".
       01  TEXTFILE-2-OCFG          PIC X(001)     VALUE "C".
           88 TEXTFILE-2-NOTOPEN    VALUE "C".
           88 TEXTFILE-2-IS-OPEN    VALUE "I", "O", "U".
       01  TEXTFILE-2-SIZE          PIC 9(004).
      *
