
         02         TEST-VAR      PIC       X(2)     VALUE         "OK".
                02  TEST-VAR-BIS               PIC X(6) VALUE "OK BIS".
         02 TEST-CC PIC X(4)            VALUE "OK 2".
         02 TEST-OK PIC            X(4) VALUE "OK 3".
         02 TEST-EE PIC X(4) VALUE "OK 4".
