       IDENTIFICATION DIVISION.
       PROGRAM-ID. PSHRINK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REC.
       05 F PIC S9(1) USAGE COMP-3 VALUE -0.
       PROCEDURE DIVISION.
           DISPLAY REC WITH NO ADVANCING.
           STOP RUN.
